

class Books {
  final String image;
  final String title;
  final String writer;
  final String description;
  final String icon;
  final String genre;
  final String review;
  final double id;

  Books({
    required this.title,
    required this.review,
    required this.image,
    required this.id,
    required this.writer,
    required this.description,
    required this.icon,
    required this.genre,
});
}

List<Books> book = [

  Books(
    id: 1 ,
    description:'أيُتها الحروفُ الدافئة: احتويني بحركاتِك التَّشكيلية،  ضُميني إليك جيِّدًا ، وافتحي قلبي لمن يستحِقه مرِّةً أُخرى ، اسكُني عالّمي الخاصَّ وشدّي رِحالك بين أحضاني فحَسّبُ... ولا تكسيريني. مذكرات قصيرة ، يوميات فصلية. شتوية ، صيفية ، خريفية وربيعية. '
        ' كما بوبها الكاتب إلى مذكرات بالية ومذكرات موحشة ومذكرات مبعثرة ومذكرات ضائعة ..ليالي ظالمة ومذكرات لك ، مذكرات خائنة ومذكرات كُتبت لها ومُحيت وأخيراً مذكرات عنيدة.'
        'وقال الكاتب عند مقدمتها:'
        'كُلٌّ مِنا يُجرح ويقعُ في الحُبِّ ويُخطئ...'
        'ولكنِ العظيم مِنَّا هو مَنْ يتدارك ذلك الخطأ بالصَّواب.'
        'وهذه المُذكرات كُتبت للتعبير عن آنيَّة أحاسيسي لحظةَ كِتابتِها فقط.'
        'وإن لم تؤثر فيَّ إيجابًا، فلنْ تؤثرُ فيَّ سلبًا.'
        '«كُنْ حذِرًا وغّضَّ بصرَكَ عَنْ كلماتي المُفضَلة، وتعلَّم مِنْ أخطائي».',
    title: 'عتمة ضوء',
    writer: 'عبدالله كمال',
    image: 'images/3tma_daw.jpg',
    icon: 'images/Abdullah_kamal.jpg',
    genre: 'مذكرات', review: '',
  ),
  Books(
    id: 1 ,
    description:'عليك أن تتعلم الحياكة بشتى أنواعها, كأن تخيط أشلائك المبتورة قطعة قطعة.',
    title: 'عتمة ضوء',
    writer: 'عبدالله كمال',
    image: 'images/3tma_daw.jpg',
    icon: 'images/Abdullah_kamal.jpg',
    genre: 'نصوص', review: '',
  ),
  Books(
    id: 1 ,
    description:'عليك أن تتعلم الحياكة بشتى أنواعها, كأن تخيط أشلائك المبتورة قطعة قطعة.',
    title: 'نبض الإلتئام',
    writer: 'أبرار الطيب',
    image: 'images/abrar.jpg',
    icon: 'images/Abrar_icon.jpg',
    genre: 'نصوص', review: '',
  ),
  Books(
    id: 2 ,
    description: 'كنت عاديا جدا, حين عمدت إلي إزاحة زجاج النافذة بعيدا, لم تتعثر أبدا وأنت تقف علي سطحها الضيق, لم تنظر إلي سطح الأرض الذي بدا لك ضيقا, وبعيدا, صوبت  نظرك للفضاء الرحب, وحين قمت بإفلات قدميك كانت تلك السحابة لاتغادر عينيك برغم إغماضك  لهما, ولم يرتتطم جسدك بالأرض قط, حتي بعد دقائق كثيرة, ساعات, أيام وسنين... ',
    title: 'عذابات الملاك الأسمر',
    writer: 'الطيب قرشي',
    image: 'images/angle.jpg',
    icon: 'images/qurashi.jpg',
    genre: 'مجموعة قصصية', review: '',
  ),
  Books(
    id: 3 ,
    description: 'تلاقو علي غير موعد في الغربة. في ركن قصي بارد جمعهم. لا يعرفون بعض ولكن  خوفهم الرصاص جهلهم يتكاثرون ويثمرون كالأشجار التي تثمر خوفا من الفناء, لا يوجد قاسم مشترك بينهم سوى وطن, في ديار الغربة إكتووا بحب الوطن و هجره, ولكن رصاص البععاد كان لهم بالمرصاد, جابهوه بصدور مفتوحة للمستقبل, عقول متفتحة, رغم التباين نجحوا و سطروا أعظم ملحمة.',
    title: 'غربة و رصاص',
    writer: 'ياسين حسن',
    image: 'images/bullet.jpg',
    icon:'images/yassin.jpg' ,
    genre: 'رواية', review: '',
  ),
  Books(
    id: 4 ,
    description: 'ثمة طرقات تتهافت من باب السطح المتآكل, هل عاد صديقيا قبل إنقضاء شطر ليلة الميلاد الأخير؟ كان الطريق لا يناسب عجلتهم وعشوائيهم غير المتكلفة, فتحت الباب فراعني (طلحة الجلك) بوجه مسحوب منكسر وشعر أشعث مجعد في هيئة رثة, هل سيعزف القتلة والضحايا والحمقي لحن نشاز قبل ترميم وجه الأوثان؟. لم يعد يعد في صفحات وجوههم الحجرية أدني علامة لمسوح الرهبان وجلاء الأولياء. إحتسي طلحة الجلك بقايا خمرتي وأخرج طابع من براثن جيب معطفه القطني فشمه فتفتحت حديقته وأحسست بخيط ضوء واني يتشابك فيهما ثم رمي بالطابع في فيه ولاكه بتمطغ. "مصيبتك أنت و زميلك أنكم كفرتم بالإمام!". لم تعد تراودني رغبة في الإستذكار و تقليب دفاتر الأزمة. "لقد عبثتم بالمسكوت في دفتر التاريخ ومسستم قضية ثورة كادت تغير تاريخنا يوما ما, الإنجليز لم يبذلو جهدا في قمع ثورة 1924 مثلما فعل الاخرون", كان ماتبقي من سيجارتي لايكفي لسحب نفس آخر. "لاجدوى طالما...." قاطعني وهو ينتفض واقفا, "شأنك ترتاب في كلامي..الحمقى والسكارى والقوادون لايسرقون!"',
    title: 'شارع جوبا',
    writer: 'صلاح التنقاري',
    image: 'images/goba.jpg',
    icon: 'images/salah.jpg',
    genre: 'رواية',
    review: '',
  ),
  Books(
    id: 5 ,
    description: 'كان لدي أمانة فسلمتها, ووديعة فأوصلتها, حان الوقت للحاق بطريق السابقين الأولين, تظل هذه الديار في أمان ما حفظتم نسلي فيكم, فإن جاء إبن الحرام, وما هو بإبن حرام, ملك يمينه السلطان وبيساره مشعل من نار, فتلك نار للحريق, فمن تدفأ بها إحترق ومن نفخ فيها إحترق ومن القي فيها عودا فقد القى فيها ولدا, ومن يلقي بولده الى النار! عندما يطوي الزمان يأتي, فذكروا أولادكم ليذكروا أولادهم قبل تمام المائة تأتيكم الأخبار بما تخشونه, هذا بلاغ سينسي وكلام سيطوي, وعندما يحين الوقت ستدركون معني كلامي, الحذر الحذر! البلاغ البلاغ!',
    title: 'حلة جابر',
    writer: 'محمد الطيب',
    image: 'images/gaber.jpg',
    icon: 'images/mohamed.jpg',
      genre: 'رواية', review: '',
  ),
  Books(
    id: 6 ,
    description: 'إكتمل نموء أطرافي فضاقت على تلك الغرفة المظلمة لم أكن أود الخروج منها، كانت جميلة و مريحة ، كان الطعام يدخل إلى معدتي عبر حبل لطيف، أحيانا كنت أداعبه بيدي، حتى أصبحنا أصدقاء، كانت هنالك أصوات تأتيني من الخارج كنت أرقص عندما أسمع " بتطلعي أنتي من صوت طفلة، وسط اللمة منسية" لم يكن رقصى على هذه الكلمات إشارة للخروج، وعندما خرجت أبعدو مني صديقي الوحيد، صرخت عندما ضربني أحدهم على ظهري وعلقني من قدماي الصغيرتان، وضعني على صدر سيدة تبكي ييدو إنها صاحبة المنزل، هل تريد إيجاراً مقابل تلك الغرفة؟ كانت صدرها دافئا حلو المذاق. أتذكر عندما كنت صغيرًا، كنت أرجع من المدرسة مبكرًا أنا وأخي الأكبر. ألقي حقيبتي المدرسية على أقرب كرسي أو سرير أو منضدة، وإذا لم أجد، فستقوم الأرض بمهمتها في احتواء حقيبتي. أرتدي بنطالًا بنيًّا وفانلة بنيّة.  كانت أُمي تعرف أن هذا اللون لا يتسخ بسرعة، فأنا لم أكن من الأطفال العاديين. ما زالت طفولتي تطاردني، جنوني، حركتي الكثيرة، انتباهي المتشتت. واندفاعيتي لتحقيق أهدافي المجنونة.  أرتدي ملابسي بسرعة ثم أذهب إلى حيثُ عم الأمين.  كان رجلًا في العقد الثامن من العمر.  له رائحة مميزة ككبار السن وسبحة وحيدة طويلة يفصل بين كل حبة وحبة من حباتها طبقة سوداء من تراب أو طين أو ذنوب، لا أدري.  كان عم الأمين فاقدًا للبصر يعتمد في ذهابه إلى المسجد على عكازة وعلى حركتي الكثيرة المزعجة وعلى الرغم من فقده للبصر، فإنه لم يكن ينزعج مني قطُّ.  كثيرًا ماكنت أجُرّهُ من جلبابه  الأبيض مازحًا؛ فيلوح لي بسبحته في الهواء وهو يبتسم.  أمسك يده نتجاوز جدولَ ماء صغيرًا لنذهب إلى المسجد، ونحن في طريقنا إلى المسجد كان عم الأمين ينظر أمامه كأنه لا يري سوى المسجد، كنت أمسك بيده وأمشي بجانبه أرفع رأسي لأرى عينيه الثابتتين وكأنما تنظران إلى مستقبل بعيد. أتعثر وأقع أحيانًا كثيرة  وأنا أنظر إليه، كانت عيناه بيضاءَ لا سواد فيهما. وكذلك ابتسامته.' ,
    title: 'سيرة ناس',
    writer: 'عمرو إبراهيم',
    image: 'images/sirat.jpg',
    icon: 'images/Amro.jpg',
      genre: 'رواية', review: '',
  ),
  Books(
    id: 7 ,
    description: 'نقطة سطر جديد فارغ موحش, خالي منك!.. هذا السطر بدونك بلا أن تزينيه بك أضحي أقسي علي من أتحمله وأشفق علي نفسي ياعزيزتي, فقد تخيلت ذلك فقط فأصاب جسدي الوهن والقشعريرة!.',
    title: 'رسائل',
    writer: 'علي عثمان الإمام',
    image: 'images/messages.jpg',
    icon: 'images/Ali.jpg',
      genre: 'نصوص', review: '',

  ),
  Books(
    id: 8 ,
    description:'شكرا بقدر خيباتي سيدي, لولاك ما كنت أدعو العابرين إلي فخ الحب, حتي ظنو أن مجنون ليلي ترك وارثا له, لقد كنت كذاللك, همت في صحراءء التوهان و رفضت يد العون, سراب بعيد يأتي كل يوم, يخبرنيي بأن كل شئ قد عاد كما كان, ماذا سيحدث إذا التقتت قلوبنا مجددا؟, ولكنه سراب يا عزيزي إهدأ, مجرد سراب.',
    title: 'بقايا قهوة',
    writer: 'الآء السر سعد',
    image: 'images/coffee.jpg',
    icon: 'images/alaa.jpg',
      genre: 'رواية', review: '',
  ),



  Books(
    id: 9 ,
    description: 'ولعل أهم ما قدمته هو أن الناس لأسباب نفسية وثقافية وإجتماعية مستعدون لتحمل أذى كثيرا خوفا من العيب. بل يمكن أن يكون العوان البديل للرواية "العيب يجبر علي الصمت المدمر", وقد أوفت اللرواية حق هذا المعنى بجدارة. فالأمين محجوب عن الأنظار كيلا يقال إبنهم مجنون, ووالدة ليلي ثارت بلاحدود عندما باحت بسر إغتصابها, والنساء يتعرضن لتحرش كثير ولكن يسكتن خوفا من العيب. وسمعة الأطباء النفسيين تجعل الناس يتجنبوهم خوفا من العيب. الرواية تقص بتفاصيلها ما يؤكد أن الناس يتحملون الكثير من الأذي خوفا من العار.',
    title: 'عهد الجنية',
    writer: 'سارة شرف الدين',
    image: 'images/gineeiah.jpg',
    icon: 'images/sara.jpg',
      genre: 'رواية', review: '',
  ),

  Books(
    id: 10,
    description: 'لترجع نفسي القديمة لساعات وإن عادت تترجاها للبقاء طوال الحياة, فلتمكث في شموخي للحياة, نخطئ مرة واحدة لنندم طوال العمر عليها, فنظل نكتب أشعارا ونغني أغاني لها لرجوعها نادمين علي ما فعلناه في ثواني الغفلة نرنم في عبارات من الوهلة بصوت مغنيها..هاشم ميرغني.. (إنت ما مشتاقة لي.. يعني ما مشتاقة ليا.. ولا ما عارفة العلي.. يعني ما مشتاقة ليا..), أظنها إشتاقت لكن شيئا ما يترجاها للتخطي من خطوط الحب ذاك, ثم كلما أراد الإلتفات إليك تواصل السير من غير تراجع حتي لو كان الحب خيار قلبها الذي بات ماثل للشفاء..',
    title: 'غفران قلبي',
    writer: 'ريل إبراهيم',
    image: 'images/gofran.jpg',
    icon: 'images/Ali.jpg',
      genre: 'رواية', review: '',
  ),

  Books(
      id: 11,
      description: 'إكتمل نموء أطرافي فضاقت على تلك الغرفة المظلمة لم أكن أود الخروج منها، كانت جميلة و مريحة ، كان الطعام يدخل إلى معدتي عبر حبل لطيف، أحيانا كنت أداعبه بيدي، حتى أصبحنا أصدقاء، كانت هنالك أصوات تأتيني من الخارج كنت أرقص عندما أسمع " بتطلعي أنتي من صوت طفلة، وسط اللمة منسية" لم يكن رقصى على هذه الكلمات إشارة للخروج، وعندما خرجت أبعدو مني صديقي الوحيد، صرخت عندما ضربني أحدهم على ظهري وعلقني من قدماي الصغيرتان، وضعني على صدر سيدة تبكي ييدو إنها صاحبة المنزل، هل تريد إيجاراً مقابل تلك الغرفة؟ كانت صدرها دافئا حلو المذاق.',
      title: 'الأرتيق',
      writer: 'أحمد طارق',
      image: 'images/tarig.jpg',
      icon:'images/ahmed.jpg' ,
      genre: 'مجموعة قصصية', review: '',
  ),

  Books(
    id: 12,
    description: 'gg',
    title: 'سوق العناقريب',
    writer: 'سراج الدين محمد',
    image: 'images/souq.jpg',
    icon:'images/siraj.jpg' ,
      genre: 'سيرة', review: '',
  ),
  Books(
      id: 13,
      description: 'في سياق متصل، نجد أنه يعتبر كتاب مميز من حيث طريقة الإخراج، تحدي كبير أن يكشف عن نفسه قبل أن يقدم أعماله والتي إشتهر بها إسفيريا عبر إحتفائه بمراكز  متقدمة نالتها قصصه المدهشة، طريقة التقديم في حد ذاتها تعتبر قصص حقيقة عاشها الكاتب ولكن حتما ليست هي التي عرفته ككاتب بين جمهوره الإنيق، كما يكمننا إعتبار فكرة الكتاب في حد ذاتها تجربة جديدة على الساحة الثقافية، وهي بمثابة إذن للجميع بأن أكتبوا كما رأيّتموني أكتب.',
      title: 'تلصص',
      writer: 'عثمان الشيخ',
      image: 'images/tlsos.jpg',
      icon: 'images/osman.jpg',
      genre: 'كتابات', review: '',
  ),
  Books(
    id: 14,
    description:'كما تتطور وتختلف شخصية الانسان, بمرور الزمن كقطع أثرية يتحول ما عشناه في الماضي, تري العين ملامح الذكرى في إسقاطاتها على أشياء مختلفة كوجه تراه في كل الوجوه, ركض الزمن وأنت ومازلت واقفا, هنا ستخاف من تأخرك, الذي يفتح عينيك لنظرة في الناحية الأخرى, لفكرة مختلفة, لشخص أكثر نضج من تلك القطعة الأثرية.',
    title: 'قهوة أيدلوجية',
    writer: 'إبتهال أزهري',
    image: 'images/idiology.jpg',
    icon: 'images/ebthal.jpg',
      genre: 'علم إجتماع', review: '',
  ),
];
